zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43L43Z96/KW43L43Z96_COMMON.h
/*
** ###################################################################
**     Processor:           KW43L43Z96MFT
**     Compilers:           GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    Rev. 1, 2026-07-08
**     Version:             rev. 1.0, 2020-05-12
**     Build:               b260721
**
**     Abstract:
**         CMSIS Peripheral Access Layer for KW43L43Z96
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2020-05-12)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file KW43L43Z96_COMMON.h
 * @version 1.0
 * @date 2020-05-12
 * @brief CMSIS Peripheral Access Layer for KW43L43Z96
 *
 * CMSIS Peripheral Access Layer for KW43L43Z96
 */

#if !defined(KW43L43Z96_COMMON_H_)
#define KW43L43Z96_COMMON_H_                     /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 129                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M33 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M33 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M33 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M33 Usage Fault Interrupt */
  SecureFault_IRQn             = -9,               /**< Cortex-M33 Secure Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M33 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M33 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M33 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M33 System Tick Interrupt */

  /* Device specific interrupts */
  CTI_IRQn                     = 0,                /**< Cross Trigger Interface interrupt */
  CMC0_IRQn                    = 1,                /**< Core Mode Controller interrupt */
  DMA0_CH0_IRQn                = 2,                /**< eDMA channel 0 error or transfer complete */
  DMA0_CH1_IRQn                = 3,                /**< eDMA channel 1 error or transfer complete */
  DMA0_CH2_IRQn                = 4,                /**< eDMA channel 2 error or transfer complete */
  DMA0_CH3_IRQn                = 5,                /**< eDMA channel 3 error or transfer complete */
  DMA0_CH4_IRQn                = 6,                /**< eDMA channel 4 error or transfer complete */
  DMA0_CH5_IRQn                = 7,                /**< eDMA channel 5 error or transfer complete */
  DMA0_CH6_IRQn                = 8,                /**< eDMA channel 6 error or transfer complete */
  DMA0_CH7_IRQn                = 9,                /**< eDMA channel 7 error or transfer complete */
  DMA0_CH8_IRQn                = 10,               /**< eDMA channel 8 error or transfer complete */
  DMA0_CH9_IRQn                = 11,               /**< eDMA channel 9 error or transfer complete */
  DMA0_CH10_IRQn               = 12,               /**< eDMA channel 10 error or transfer complete */
  DMA0_CH11_IRQn               = 13,               /**< eDMA channel 11 error or transfer complete */
  DMA0_CH12_IRQn               = 14,               /**< eDMA channel 12 error or transfer complete */
  DMA0_CH13_IRQn               = 15,               /**< eDMA channel 13 error or transfer complete */
  DMA0_CH14_IRQn               = 16,               /**< eDMA channel 14 error or transfer complete */
  DMA0_CH15_IRQn               = 17,               /**< eDMA channel 15 error or transfer complete */
  EWM0_IRQn                    = 18,               /**< External Watchdog Monitor interrupt */
  MCM0_IRQn                    = 19,               /**< Miscellaneous Control Module0 interrupt */
  MSCM0_IRQn                   = 20,               /**< Miscellaneous System Control Module interrupt */
  SYSCON0_IRQn                 = 21,               /**< System control module */
  SECCON0_IRQn                 = 22,               /**< Secure System control module */
  SPC0_IRQn                    = 23,               /**< System Power Controller 0 interrupt */
  WUU0_IRQn                    = 24,               /**< Wake-Up Unit 0 interrupt */
  WDOG0_IRQn                   = 25,               /**< Watchdog Timer 0 interrupt */
  WDOG1_IRQn                   = 26,               /**< Watchdog Timer 1 interrupt */
  CDOG0_IRQn                   = 27,               /**< Code watchdog 0 interrupt */
  CDOG1_IRQn                   = 28,               /**< Code watchdog 1 interrupt */
  SCG0_IRQn                    = 29,               /**< System Clock Generator 0 interrupt */
  SFA0_IRQn                    = 30,               /**< Signal Frequency Analyzer 0 interrupt */
  FMU0_IRQn                    = 31,               /**< Flash Memory Unit 0 interrupt */
  SFA1_IRQn                    = 32,               /**< SFA interrupt for FRO-200M calibration */
  DSB0_IRQn                    = 33,               /**< Data Stream Buffer */
  TRDC0_IRQn                   = 34,               /**< Trusted Resource Domain Controller 0 interrupt */
  RTC_Alarm_IRQn               = 35,               /**< Real Time Clock 0 alarm interrupt */
  RTC_Seconds_IRQn             = 36,               /**< Real Time Clock 0 seconds interrupt */
  LPTMR0_IRQn                  = 37,               /**< Low-Power Timer0 interrupt */
  LPTMR1_IRQn                  = 38,               /**< Low-Power Timer1 interrupt */
  LPIT0_IRQn                   = 39,               /**< Low-Power Periodic Interrupt Timer 0 interrupt */
  TPM_0_IRQn                   = 40,               /**< Timer / PWM Module 0 interrupt */
  TPM_1_IRQn                   = 41,               /**< Timer / PWM Module 1 interrupt */
  TPM_2_IRQn                   = 42,               /**< Timer / PWM Module 2 interrupt */
  TPM_3_IRQn                   = 43,               /**< Timer / PWM Module 3 interrupt */
  TPM_4_IRQn                   = 44,               /**< Timer / PWM Module 4 interrupt */
  MU1_IRQn                     = 45,               /**< Interrupt from MU1/DSP-V lite */
  SYSCON0_ECC_IRQn             = 46,               /**< SRAM ECC Error interrupt */
  LPI2C0_IRQn                  = 47,               /**< Low-Power Inter Integrated Circuit 0 interrupt */
  LPI2C1_IRQn                  = 48,               /**< Low-Power Inter Integrated Circuit 1 interrupt */
  LPSPI0_IRQn                  = 49,               /**< Low-Power Serial Peripheral Interface 0 interrupt */
  LPSPI1_IRQn                  = 50,               /**< Low-Power Serial Peripheral Interface 1 interrupt */
  LPSPI2_IRQn                  = 51,               /**< Low-Power Serial Peripheral Interface 2 interrupt */
  LPUART0_IRQn                 = 52,               /**< Low-Power Universal Asynchronous Receiver/Transmitter 0 interrupt */
  LPUART1_IRQn                 = 53,               /**< Low-Power Universal Asynchronous Receiver/Transmitter 1 interrupt */
  RF_ZIGBEE_IRQn               = 55,               /**< Zigbee Mac controller */
  RF_Generic_IRQn              = 56,               /**< Generic Link Layer interrupt */
  RF_BRIC_IRQn                 = 57,               /**< Baix Radio Crypto */
  RF_LCL_IRQn                  = 58,               /**< Localization control */
  RF_WOR_IRQn                  = 59,               /**< Wake on radio */
  RFMC_IRQn                    = 60,               /**< RFMC interrupt */
  COEX_INT_IRQn                = 63,               /**< COEX_INT_IRQn */
  GPIOA_INT0_IRQn              = 65,               /**< General Purpose Input/Output A interrupt 0 */
  GPIOA_INT1_IRQn              = 66,               /**< General Purpose Input/Output A interrupt 1 */
  GPIOB_INT0_IRQn              = 67,               /**< General Purpose Input/Output B interrupt 0 */
  GPIOB_INT1_IRQn              = 68,               /**< General Purpose Input/Output B interrupt 1 */
  GPIOC_INT0_IRQn              = 69,               /**< General Purpose Input/Output C interrupt 0 */
  GPIOC_INT1_IRQn              = 70,               /**< General Purpose Input/Output C interrupt 1 */
  GPIOD_INT0_IRQn              = 71,               /**< General Purpose Input/Output D interrupt 0 */
  GPIOD_INT1_IRQn              = 72,               /**< General Purpose Input/Output D interrupt 1 */
  ADC0_IRQn                    = 77,               /**< Analog-to-Digital Converter - General Purpose0 interrupt */
  CMP0_IRQn                    = 78,               /**< Comparator - General Purpose0 interrupt */
  FLEXPWM0_SUBMODULE0_CMP_IRQn = 79,               /**< PWM_CMP0: Submodule 0 compare interrupt */
  FLEXPWM0_SUBMODULE0_CAP_IRQn = 80,               /**< PWM_CAP0: Submodule 0 input capture interrupt */
  FLEXPWM0_SUBMODULE0_RELOAD_IRQn = 81,            /**< PWM_RELOAD0: Submodule 0 Reload interrupt */
  FLEXPWM0_SUBMODULE1_CMP_IRQn = 82,               /**< PWM_CMP1: Submodule 1 compare interrupt */
  FLEXPWM0_SUBMODULE1_CAP_IRQn = 83,               /**< PWM_CAP1: Submodule 1 input capture interrupt */
  FLEXPWM0_SUBMODULE1_RELOAD_IRQn = 84,            /**< PWM_RELOAD1: Submodule 1 Reload interrupt */
  FLEXPWM0_SUBMODULE2_CMP_IRQn = 85,               /**< PWM_CMP2: Submodule 2 compare interrupt */
  FLEXPWM0_SUBMODULE2_CAP_IRQn = 86,               /**< PWM_CAP2: Submodule 2 input capture interrupt */
  FLEXPWM0_SUBMODULE2_RELOAD_IRQn = 87,            /**< PWM_RELOAD2: Submodule 2 Reload interrupt */
  FLEXPWM0_RELOAD_ERROR_IRQn   = 88,               /**< PWM_RERR: Reload Error interrupt */
  FLEXPWM0_FAULT_IRQn          = 89,               /**< PWM_FAULT: PWM fault input interrupt */
  ITRC0_IRQn                   = 90,               /**< Output of Intrusion and tamper response controller (ITRC_IRQ) */
  TDET_IRQn                    = 91,               /**< Tamper detection interrupt */
  MU0_IRQn                     = 92,               /**< Interrupt from MU0 to CPU0 */
  INTM_IRQn                    = 93,               /**< Error flag to show Radio interrrupt is not serviced in time */
  SGI_IRQn                     = 94,               /**< SGI Interrupt */
  SECURE_ERR_IRQn              = 95,               /**< Secure IP Error Interrupt */
  PKC_IRQn                     = 96,               /**< PKC Module Error */
  TRNG0_IRQn                   = 97,               /**< TRNG Module Error */
  FLASH_Arbiter_IRQn           = 98,               /**< Combined interrupt from Flash Arbiter  */
  BLE_INT0_IRQn                = 99,               /**< BLE LL interrupt Set 0 (BLE_INT0_IRQn) */
  BLE_INT1_IRQn                = 100,              /**< BLE LL interrupt Set 1 (BLE_INT1_IRQn) */
  BLE_INT2_IRQn                = 101,              /**< BLE LL interrupt Set 2 (BLE_INT2_IRQn) */
  BRF_INT_IRQn                 = 102,              /**< BLE LL/ BTRFIRQ (BRF_INT_IRQn) */
  T1_INT_IRQn                  = 103,              /**< BLE LL / RTU 1 (T1_INT_IRQn) */
  T2_INT_IRQn                  = 104,              /**< BLE LL / RTU 2 (T2_INT_IRQn) */
  T3_INT_IRQn                  = 105,              /**< BLE LL / RTU 3 (T3_INT_IRQn) */
  T4_INT_IRQn                  = 106,              /**< BLE LL / RTU 4 (T4_INT_IRQn) */
  WDG1_IRQn                    = 107,              /**< BLE LL / RTU 5 (WDG1_INT_IRQn) */
  OSC_32M_READY_IRQn           = 108,              /**< 32M Crystal OSC ready interrupt */
  RBME_INT_IRQn                = 109,              /**< Radio Bit Manipulation Engine (RBME_INT_IRQn) */
  RSM_INT_IRQn                 = 110,              /**< Ranging State Machine (RSM_INT_IRQn) */
  PLL_ABORT_INT_IRQn           = 111,              /**< PLL control (PLL_ABORT_INT_IRQn) */
  DMA_LIGHT_IRQn               = 112,              /**< DMA light */
  DEVICE_MAX_IRQn              = DMA_LIGHT_IRQn    /**< Highest IRQ number for this device */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M33 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

